app/controllers/articles_controller.rb

  def update
    article = Article.find(params[:id])
    article.update(title: params[:article][:title], description: params[:article][:title])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My edit"], ["updated_at", "2020-01-10 00:10:15.338408"], ["id", 1]]